Autodesk.Revit.UI.TaskDialog.EnableDoNotShowAgain(System.String,System.Boolean,System.String)
Enables the "Do not show again" for a task dialog.
dialogId:  The non localized dialog identifier. It is used to store in Revit.ini the choice the user made the last time the dialog was shown.
enableDoNotShow:  The boolean to enable or disable the do not show me again functionality.
doNotShowText:  The customized localized string that shows along with the do not show again checkbox.
Remarks:
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  Thrown if the TaskDialog also has VerificationText set as the two cannot coincide in the same TaskDialog.
When enabled, the TaskDialog will contain a checkbox with the text specified to not show the task dialog again.
By default a task dialog will not have this check box.
If the user checks the check box, the next call to Show() for the indicated dialog id returns the choice the user made the last time the dialog was shown.
Since: 2020

Autodesk.Revit.UI.TaskDialog.WasExtraCheckBoxChecked
Gets the status of the extra checkbox.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  Thrown when the task dialog does not have an extra checkbox or the task dialog is not shown yet.
Returns:  Whether the extra checkbox is checked.
Since: 2017

Autodesk.Revit.UI.TaskDialog.Show(System.String,System.String,Autodesk.Revit.UI.TaskDialogCommonButtons,Autodesk.Revit.UI.TaskDialogResult)
Shows a task dialog with title, main instruction, common buttons and default buttons.
title:  The title of the task dialog.
mainInstruction:  The main instruction of the task dialog.
buttons:  The common buttons to be shown the task dialog.
defaultButton:  The default button of the task dialog.
Returns:  The user's response to the task dialog.
Since: 2011

Autodesk.Revit.UI.TaskDialog.Show(System.String,System.String,Autodesk.Revit.UI.TaskDialogCommonButtons)
Shows a task dialog with title, main instruction and common buttons.
title:  The title of the task dialog.
mainInstruction:  The main instruction of the task dialog.
buttons:  The common buttons to be shown the task dialog.
Returns:  The user's response to the task dialog.
Since: 2011

Autodesk.Revit.UI.TaskDialog.Show(System.String,System.String)
Shows a task dialog.
Shows a task dialog with title, main instruction and a Close button.
title:  The title of the task dialog.
mainInstruction:  The main instruction of the task dialog.
Returns:  The user's response to the task dialog.
Since: 2011

Autodesk.Revit.UI.TaskDialog.WasVerificationChecked
Gets the status of the verification checkbox.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  Thrown when the task dialog does not have verification checkbox or the task dialog is not shown yet.
Returns:  Whether the verification checkbox is checked.
Since: 2011

Autodesk.Revit.UI.TaskDialog.Show
Shows the task dialog.
Returns:  The user's response to the task dialog.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when
the task dialog is shown out of main thread of Revit or when an extra checkbox and a verification checkbox are enabled at the same time.
Since: 2011

Autodesk.Revit.UI.TaskDialog.AddCommandLink(Autodesk.Revit.UI.TaskDialogCommandLinkId,System.String)
Adds a CommandLink associated to the given id, displaying the indicating main content.
id:  The id of the CommandLink. This corresponds to the value returned by Show() when the link is chosen by the user.
mainContent:  The main content of the CommandLink.
Remarks:
Parameter mainContent cannot contain newlines.
If the id has already been set to the task dialog, the new CommandLink definition overrides the old one.
CommandLinks will always be shown in the dialog in the order of their ids.
Since: 2011

Autodesk.Revit.UI.TaskDialog.AddCommandLink(Autodesk.Revit.UI.TaskDialogCommandLinkId,System.String,System.String)
Adds a CommandLink to the TaskDialog.
Adds a CommandLink associated to the given id, displaying the indicating main and supporting content.
id:  The id of the CommandLink. This corresponds to the value returned by Show() when the link is chosen by the user.
mainContent:  The main content of the CommandLink.
supportingContent:  The main content of the CommandLink.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:  Thrown when mainContent is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:  Thrown when mainContent is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentException:  Thrown when the mainContent contains newline characters.
Remarks:
Parameter mainContent cannot contain newlines.
If the id has already been set to the task dialog, the new CommandLink definition overrides the old one.
CommandLinks will always be shown in the dialog in the order of their ids.
Since: 2011

Autodesk.Revit.UI.TaskDialog.EnableMarqueeProgressBar
Enables a marquee style progress bar to be displayed in the TaskDialog.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  Thrown if the TaskDialog also has ExtraCheckBoxText set as the two cannot coincide in the same TaskDialog.
Remarks:
When true, the TaskDialog will display a progress bar that has an indeterminate start and stop.
A progress bar is a window that an application can use to indicate the progress of a lengthy operation.
It consists of a rectangle that is animated as an operation progresses. The animation continues until the TaskDialog is closed.
The default value is false.
Since: 2020

Autodesk.Revit.UI.TaskDialog.TitleAutoPrefix
Whether the TaskDialog's title will automatically have the add-in name added as a prefix.
Remarks:  The default value is true.
Since: 2011

Autodesk.Revit.UI.TaskDialog.CommonButtons
The push buttons displayed in the task dialog.
Remarks:
If no common button or CommandLink is added to the task dialog, the dialog will contain the Close common button by default.
Revit task dialogs are following these conventions for commit button usage:
Use a single Close button instead of a single OK button on informational messages.  Use a question at the end of the Main Instruction with a Yes/No combo (or Yes/No/Cancel) instead of OK/Cancel. This should work 99% of the time. For example: "Are you sure you want to overwrite the file?" and use Yes/No buttons.  Do not customize the button names unless there is a very good reason to do so. For example, "Are you sure you want to save the file?" would use Yes/No buttons and not Save/No or Save/Cancel.
Since: 2011

Autodesk.Revit.UI.TaskDialog.MainIcon
The icon shown in the task dialog.
Remarks:
There is no icon by default.
Task dialogs in Revit rarely use icons, to reduce the visual clutter shown to the user. Only one icon can be used
in the task dialog, the Warning (!) icon, and it should be used only when there is a risk of data loss or
significant time lost. If there is no data loss or time lost as a possible result of the message, do not use the icon.
Since: 2011

Autodesk.Revit.UI.TaskDialog.DefaultButton
The default button for the dialog.
Remarks:
If DefaultButton is TaskDialogResult.None or its value does not correspond to any CommonButton or CommandLink in the dialog,
then the first button in the dialog will be the default.
Since: 2011

Autodesk.Revit.UI.TaskDialog.AllowCancellation
Whether the task dialog can be cancelled if no cancel button is specified.
Remarks:  The default value is true. If there is a cancel button in the task dialog, the it always can be cancelled.
Since: 2011

Autodesk.Revit.UI.TaskDialog.FooterText
FooterText is used in the footer area of the task dialog.
Remarks:
HTML Hyperlink tags can be used when specifying Footertext. These will work like normal hyperlinks
where clicking them will launch the default browser to the location specified.
Revit special cases hyperlinks containing the following:
single character '#' to indicate to launch Revit's contextual help for the dialog.
The Topic passed for the contextual help takes the form H[id] where id is the Id for the task dialog.   string of the form 'rvthelptopic:[Topic]' to indicate to launch Revit's contextual help
for the topic specified. If topic is omitted, it is treated the same as if '#' was specified instead.
Since: 2011

Autodesk.Revit.UI.TaskDialog.ExtraCheckBoxText
ExtraCheckBoxText is used to label the extra checkbox.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  Thrown if the TaskDialog also has EnableMarqueeProgressBar set as the two cannot coincide in the same TaskDialog.
Remarks:
If ExtraCheckBoxText is set, a checkbox with the text will be shown. You can get the response of checkbox by checking the return value of the WasExtraCheckBoxChecked() method.
Since: 2017

Autodesk.Revit.UI.TaskDialog.VerificationText
VerificationText is used to label the verification checkbox.
Remarks:
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  Thrown if the TaskDialog has already enabled the Do not show message as the two cannot coincide in the same TaskDialog.
If VerificationText is set, a checkbox with the text will be shown. You can get the response of checkbox by checking the return value of the WasVerificationChecked() method.
Since: 2011

Autodesk.Revit.UI.TaskDialog.ExpandedContent
ExpandedContent is hidden by default and will display at the bottom of the task dialog when the "Show details" button is pressed.
Remarks:
If added to a dialog, a Show/Hide toggle button displays at the bottom of the task dialog. The Expanded Content is hidden by default.
This area is used when even more information needs to be relayed to the user than space allows. It is rarely used, but can be used for showing technical
information passed through in a variable, for example back-end error information, lists of files, etc.
Variable information should always be introduced with a lead-in sentence.
Since: 2011

Autodesk.Revit.UI.TaskDialog.MainContent
MainContent is the smaller text that appears just below the main instructions.
Remarks:
The Main Content is optional. It should be used to give further explanation to the user, such as how to correct the problem or work around the situation.
It displays in a smaller black font below the main instructions. Follow these guidelines:
Text should be clear and jargon free.  Main content should not simply restate the main instructions in a different way, they should contain additional information
that builds upon or reinforces the main instructions.  Main content should be written in sentence format (normal capitalization and punctuation).  Address the user directly as "you" when needed.
Since: 2011

Autodesk.Revit.UI.TaskDialog.Id
The Id of the task dialog.
Remarks:  Id is used as follows:
TaskDialogShowingEventArgs.DialogId for DialogBoxShowing events   As part of the Contextual Help Topic when invoking Revit contextual help
Since: 2011

Autodesk.Revit.UI.TaskDialog.MainInstruction
The large primary text that appears at the top of a task dialog.
Remarks:
It should concisely sum up the problem or situation that is causing the message to display. Follow these guidelines:
Every task dialog includes a main instruction.  Text should not exceed three lines.  Text should use plain language and be jargon free.  Main instructions should be written in sentence format – normal capitalization and punctuation.  Address the user directly as "you" when appropriate.  When presented with multiple command link options the standard final line for the main instructions should be,
"What do you want to do?"
Revit will automatically break lines to make the message fit well. "\n" also breaks down to the next line. For a paragraph break, use "\n\n".
Hyperlinks added to the main instructions will not be enabled when the dialog is shown on Vista.
Since: 2011

Autodesk.Revit.UI.TaskDialog.Title
Title of the task dialog.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:  Thrown when setting the value to null.
Throws Autodesk.Revit.Exceptions.ArgumentException:  Thrown when setting the value to an empty string or string contains newline characters.
Remarks:
Titles of task dialogs should be unique. Do not reuse the same title for multiple task dialogs.
Newline characters are not allowed in Title.
When the dialogs is shown, Revit will put "External Command Name –" or "External Application –" in the front of the value by default. Examples:
Plug-in Name – No Rooms to Calculate  Plug-in Name – Invalid Value for Length
You can suppress it by setting TitleAutoPrefix to false.
Titles should describe the nature of the problem or state the situation that currently exists.
The title tells the user why they are getting the message, not what they are supposed to do.
Since: 2011

Autodesk.Revit.UI.TaskDialog.#ctor(System.String)
Creates a task dialog with title.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:  Thrown when title is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:  Thrown when title is an empty string.
Since: 2011

Autodesk.Revit.UI.TaskDialog
A task dialog is a dialog box that can be used to display information and receive simple input from the user. It has a common set of controls
that are arranged in a standard order to assure consistent look and feel.
Remarks:
There are two ways to create and show a task dialog to the user. The first option is to construct the TaskDialog, set its properties individually, and use
the instance method Show() to show it to the user. The second is to use one of the static Show() methods to construct and show the dialog in one step.
When you use the static methods only a subset of the options can be specified.
Please follow Revit standards to create task dialogs. The standards are listed in the remarks of each property or method.
Since: 2011